In [1]:
import pandas as pd

In [2]:
customer = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['Will', 'Jane', 'Alex', 'Bill', 'Zack', 'Mark'],
    'referee_id': [None, None, 2, None, 1, 2]
})

In [3]:
customer

   id  name  referee_id
0   1  Will         NaN
1   2  Jane         NaN
2   3  Alex         2.0
3   4  Bill         NaN
4   5  Zack         1.0
5   6  Mark         2.0

In [7]:
customer[(customer['referee_id'] != 2) | (customer['referee_id'].isna())][['name']]

   name
0  Will
1  Jane
3  Bill
4  Zack